Tekla.Structures.CatalogInternal.dotcatShape_t
The shape data.

Tekla.Structures.CatalogInternal.dotcatShape_t.Name
The name.

Tekla.Structures.CatalogInternal.dotcatShape_t.TypeGuid
The Guid of the shape

Tekla.Structures.CatalogInternal.dotcatShape_t.GeometryGuid
The Guid of the shape geometry

Tekla.Structures.CatalogInternal.dotcatShape_t.FingerPrint
The geometric fingerprint of the shape, calculated by Structures.

Tekla.Structures.CatalogInternal.dotcatShape_t.Extrema
The extrema.

Tekla.Structures.CatalogInternal.dotcatShape_t.IsSolid
Flag indicating whether the shape geometry is a solid.

Tekla.Structures.CatalogInternal.dotcatShape_t.Polymesh
Polymesh defining the geometry to be inserted

Tekla.Structures.CatalogInternal.dotcatShape_t.UpAxis
What axis is in the UP direction in the shape
Can not be of the enum type ShapeUpAxis here because of
"Inconsistent accessibility". See other enum types in DotNet for same pattern.

Tekla.Structures.CatalogInternal.dotcatShape_t.BrepType
Defines BrepType of shapes.